#Использовать autumn
#Использовать asserts
#Использовать ".."
#Использовать "."

Функция ПолучитьПоделку()
	Поделка = Новый Поделка();
	Поделка
		.ДобавитьЖелудь(Тип("ТестовыйЖелудь"))
		.ЗапуститьПриложение();
	
	Возврат Поделка;
КонецФункции

&Тест
Процедура ПроверкаМассива() Экспорт

	// Дано 
	Поделка = ПолучитьПоделку();

	// Когда
	ТестовыйЖелудь = Поделка.НайтиЖелудь("ТестовыйЖелудь");

	// Тогда
	Ожидаем.Что(ТестовыйЖелудь.ПустойМассив).ИмеетТип("Массив");
	Ожидаем.Что(ТестовыйЖелудь.ПустойМассив.Количество()).Равно(0);

	Ожидаем.Что(ТестовыйЖелудь.МассивСРазмером1).ИмеетТип("Массив");
	Ожидаем.Что(ТестовыйЖелудь.МассивСРазмером1.Количество()).Равно(1);

КонецПроцедуры

&Тест
Процедура ПроверкаСоответствие() Экспорт

	// Дано 
	Поделка = ПолучитьПоделку();

	// Когда
	ТестовыйЖелудь = Поделка.НайтиЖелудь("ТестовыйЖелудь");

	// Тогда
	Ожидаем.Что(ТестовыйЖелудь.Соответствие).ИмеетТип("Соответствие");
	Ожидаем.Что(ТестовыйЖелудь.Соответствие.Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура ПроверкаСтруктура() Экспорт

	// Дано 
	Поделка = ПолучитьПоделку();

	// Когда
	ТестовыйЖелудь = Поделка.НайтиЖелудь("ТестовыйЖелудь");

	// Тогда
	Ожидаем.Что(ТестовыйЖелудь.СтруктураСКлючами).ИмеетТип("Структура");
	Ожидаем.Что(ТестовыйЖелудь.СтруктураСКлючами.Количество()).Равно(2);

	Ожидаем.Что(ТестовыйЖелудь.СтруктураСКлючами.Свойство("Ключ1")).Равно(Истина);
	Ожидаем.Что(ТестовыйЖелудь.СтруктураСКлючами.Свойство("Ключ2")).Равно(Истина);

	Ожидаем.Что(ТестовыйЖелудь.ПустаяСтруктура).ИмеетТип("Структура");
	Ожидаем.Что(ТестовыйЖелудь.ПустаяСтруктура.Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура ПроверкаТаблицаЗначений() Экспорт

	// Дано 
	Поделка = ПолучитьПоделку();

	// Когда
	ТестовыйЖелудь = Поделка.НайтиЖелудь("ТестовыйЖелудь");

	// Тогда
	Ожидаем.Что(ТестовыйЖелудь.ТЗБезКолонок).ИмеетТип("ТаблицаЗначений");
	Ожидаем.Что(ТестовыйЖелудь.ТЗБезКолонок.Количество()).Равно(0);
	Ожидаем.Что(ТестовыйЖелудь.ТЗБезКолонок.Колонки.Количество()).Равно(0);

	Ожидаем.Что(ТестовыйЖелудь.ТЗ).ИмеетТип("ТаблицаЗначений");
	Ожидаем.Что(ТестовыйЖелудь.ТЗ.Количество()).Равно(0);
	Ожидаем.Что(ТестовыйЖелудь.ТЗ.Колонки.Количество()).Равно(2);
	Ожидаем.Что(ТестовыйЖелудь.ТЗ.Колонки[0].Имя).Равно("Колонка1");
	Ожидаем.Что(ТестовыйЖелудь.ТЗ.Колонки[1].Имя).Равно("Колонка2");

КонецПроцедуры